{
  "file_name": "CrashControllerIntegrationTests.java",
  "file_path": "org/springframework/samples/petclinic/system/CrashControllerIntegrationTests.java",
  "file_summary": "This Java file, `CrashControllerIntegrationTests.java`, is an integration test suite for the `CrashController` within the Spring PetClinic application. Its primary purpose is to verify how the application handles and presents error responses when an unexpected exception occurs. Specifically, it tests the `/oups` endpoint, which is designed to intentionally throw an exception. The tests are configured using `@SpringBootTest` with a random port and disabled database-related auto-configurations to focus purely on error handling. It includes two main test methods: one to check the JSON error response for correctness (ensuring it contains expected fields like timestamp, status, and error message) and another to verify the HTML error page (checking for specific content and confirming it's not the generic Spring Boot whitelabel error page). This class ensures robust error reporting for different client `Accept` types.",
  "attributes": [
    {
      "name": "port",
      "data_type": "int",
      "membership_type": "private"
    },
    {
      "name": "rest",
      "data_type": "org.springframework.boot.test.web.client.TestRestTemplate",
      "membership_type": "private"
    }
  ],
  "functions": [
    {
      "name": "testTriggerExceptionJson",
      "description": "Tests the `/oups` endpoint to ensure that when an exception is triggered, the application returns an HTTP 500 Internal Server Error status with a well-formed JSON body containing expected error details like timestamp, status, error type, message, and path."
    },
    {
      "name": "testTriggerExceptionHtml",
      "description": "Tests the `/oups` endpoint with an `Accept: text/html` header to verify that the application returns an HTTP 500 Internal Server Error status with a custom HTML error page, containing specific error messages and not the default Spring Boot whitelabel error page."
    }
  ]
}