{
  "file_name": "mvnw",
  "file_path": "N/A",
  "file_summary": "This shell script serves as the Apache Maven Wrapper startup script, designed to simplify the use of Maven within a project by automatically downloading and installing the specified Maven distribution if it's not already present. It reads the `distributionUrl` and optional `distributionSha256Sum` from the `.mvn/wrapper/maven-wrapper.properties` file to determine which Maven version to use. The script first attempts to locate the Maven distribution in a user's local cache (`~/.m2/wrapper/dists`). If not found, it downloads the distribution using `wget`, `curl`, or a Java-based fallback, extracting it to the cache. It includes logic for OS-specific path handling (Cygwin/MinGW), checksum validation, and support for both standard Maven and the Apache Maven Daemon (mvnd). Environment variables like `JAVA_HOME`, `MVNW_REPOURL`, `MVNW_USERNAME`, `MVNW_PASSWORD`, and `MVNW_VERBOSE` can be used to control its behavior. After successfully preparing the Maven environment, it executes the appropriate Maven command, passing all original arguments.",
  "attributes": [
    "JAVA_HOME: string (Environment Variable, optional, specifies JDK home directory)",
    "MVNW_REPOURL: string (Environment Variable, optional, custom repository URL for downloading Maven)",
    "MVNW_USERNAME: string (Environment Variable, optional, username for repository authentication)",
    "MVNW_PASSWORD: string (Environment Variable, optional, password for repository authentication)",
    "MVNW_VERBOSE: string (Environment Variable, optional, 'true' for verbose output, 'debug' for script tracing)",
    "MAVEN_USER_HOME: string (Script/Environment Variable, defaults to ~/.m2, user's Maven home directory)",
    "MAVEN_HOME: string (Script Variable, calculated path to the specific Maven distribution)",
    "distributionUrl: string (Script Variable, read from maven-wrapper.properties, URL of Maven distribution)",
    "distributionSha256Sum: string (Script Variable, read from maven-wrapper.properties, SHA-256 checksum for validation)",
    "MVN_CMD: string (Script Variable, the actual command to execute, either 'mvn' or 'mvnd.sh')",
    "JAVACMD: string (Script Variable, path to the Java executable)",
    "JAVACCMD: string (Script Variable, path to the Javac compiler executable)",
    "TMP_DOWNLOAD_DIR: string (Script Variable, temporary directory for downloads)"
  ],
  "functions": [
    "native_path",
    "set_java_home",
    "hash_string",
    "verbose",
    "die",
    "trim",
    "exec_maven"
  ]
}