{
  "file_name": "VetController.java",
  "file_path": "src/main/java/org/springframework/samples/petclinic/vet/VetController.java",
  "file_summary": "This `VetController` class serves as a Spring MVC controller responsible for handling web requests related to veterinary professionals in the Spring PetClinic application. It is annotated with `@Controller`, indicating its role in the presentation layer. The controller injects `VetRepository` to interact with the data layer for retrieving vet information.\n\nIts primary functions include providing two distinct endpoints:\n1.  `/vets.html`: This endpoint renders a paginated list of vets to a web page (`vets/vetList`). It manages the pagination logic, allowing users to browse vets page by page, displaying details like current page, total pages, and total items.\n2.  `/vets`: This endpoint exposes a RESTful API, returning a `Vets` object (a wrapper for a list of `Vet` objects) as JSON or XML. This is designed for programmatic consumption, offering a complete list of all veterinarians.\n\nThe controller encapsulates the logic for fetching vet data, applying pagination where necessary, and preparing it for both human-readable web views and machine-readable API responses.",
  "attributes": [
    {
      "name": "vetRepository",
      "data_type": "VetRepository",
      "membership_type": "private final"
    }
  ],
  "functions": [
    {
      "name": "VetController",
      "parameters": [
        {
          "name": "vetRepository",
          "data_type": "VetRepository"
        }
      ],
      "return_type": "void",
      "visibility": "public",
      "description": "Constructor for VetController, injecting the VetRepository dependency."
    },
    {
      "name": "showVetList",
      "parameters": [
        {
          "name": "page",
          "data_type": "int",
          "annotation": "@RequestParam(defaultValue = \"1\")"
        },
        {
          "name": "model",
          "data_type": "Model"
        }
      ],
      "return_type": "String",
      "visibility": "public",
      "description": "Handles GET requests to '/vets.html', displaying a paginated list of veterinarians to the web UI. It fetches a page of vets and adds pagination details to the model."
    },
    {
      "name": "addPaginationModel",
      "parameters": [
        {
          "name": "page",
          "data_type": "int"
        },
        {
          "name": "paginated",
          "data_type": "Page<Vet>"
        },
        {
          "name": "model",
          "data_type": "Model"
        }
      ],
      "return_type": "String",
      "visibility": "private",
      "description": "Helper method to add pagination attributes (currentPage, totalPages, totalItems, listVets) to the Model for UI rendering."
    },
    {
      "name": "findPaginated",
      "parameters": [
        {
          "name": "page",
          "data_type": "int"
        }
      ],
      "return_type": "Page<Vet>",
      "visibility": "private",
      "description": "Helper method to retrieve a paginated list of vets from the VetRepository. Sets the page size to 5."
    },
    {
      "name": "showResourcesVetList",
      "parameters": [],
      "return_type": "Vets",
      "visibility": "public",
      "annotation": "@ResponseBody",
      "description": "Handles GET requests to '/vets', returning a list of all veterinarians as a RESTful resource (JSON/XML). This is suitable for client-side consumption."
    }
  ]
}